Repository: ferryfer14/vending-machine
Catalog: lib/l10n/app_*.arb
Languages: id

# start
source: Touch anywhere to start
id: Tekan dimana saja untuk memulai

# title_form
source: Personal Data
id: Lengkapi Data Diri

# subtitle_form
source: Please fill out this personal data form
id: Masukkan email & nomor telepon

source: Full Name
id: Nama Lengkap

# fullname_ex
source: Ex: Fiky Aja
id: Cth: Fiky Aja

# fullname_cant_empty
source: Full Name Can't be empty
id: Nama lengkap tidak boleh kosong

source: Email
id: Masukkan alamat email

# email_ex
source: Ex: mail@mail.com
id: Cth: mail@mail.com

# email_cant_empty
source: Email Can't be empty
id: Alamat email tidak boleh kosong

source: Email not valid
id: Alamat email tidak valid

# phone
source: Phone Number
id: Masukkan nomor telefon

# phone_ex
source: Ex: 08xxxxxxxx
id: Cth: 08xxxxxxxx

# phone_cant_empty
source: Phone Number Can't be empty
id: Nomor telefon tidak boleh kosong

# phone_not_valid
source: Phone Number not valid
id: Nomor telefon tidak valid

# phone_already_user
source: Phone Number already to used
id: Nomor telefon telah digunakan

# invalid_form
source: Form data not valid
id: Data tidak valid

source: Submit
id: Simpan & Lanjutkan

source: Close
id: Tutup

source: Powered By
id: Didukung oleh

# title_lost_connection
source: Oops, looks like you lost your internet connection
id: Oops, sepertinya koneksi internet anda terputus

# detail_lost_connection
source: Please make sure you device is connected to the network to continue.
id: Pastikan perangkat anda terhubung ke internet untuk melanjutkan.

source: Try Again
id: Coba Lagi

# our_item
source: Our Item Products
id: Pilih salah satu produk berikut

source: No data
id: Tidak ada data

source: Detail Product
id: Detail Produk

source: Choose
id: Pilih

source: Out of Stock
id: Stok kosong

# waiting
source: Waiting for goods
id: Menunggu barang

# waitings
source: Waiting
id: Mohon tunggu

# release
source: Items released
id: Barang dirilis

# processed
source: Transaction processed
id: Transaksi diproses

# success
source: Transaction success
id: Transaksi berhasil

# failed
source: Transaction failed
id: Transaksi gagal

# des_failed
source: Sorry transaction failed
id: Maaf transaksi gagal dilakukan

# des_success
source: Congratulations on a successful transaction! You can retrieve your product by accessing the slot at the bottom of the machine.
id: Selamat transaksi telah sukses dilakukan! Kamu bisa mengambil produkmu dengan mengakses slot pada bagian bawah mesin.

# des_release
source: Wait until the product release process is successful and then you can pick up your product!
id: Tunggu hingga proses perilisan produk sukses lalu kamu bisa mengambil produkmu!

# error
source: An error occurred, try again
id: Terjadi kesalahan

# onprosess
source: On process
id: Dalam proses

# onrelease
source: Released
id: Direlease

source: Fail
id: Gagal

# getonbot
source: Get on bottom
id: Ambil di bawah

source: Quantity of goods
id: Jumlah Barang

source: Product description
id: Deskripsi Produk

# add_cart
source: Add to cart
id: Tambah ke keranjang

# view_cart
source: See cart
id: Lihat keranjang

source: Supported e-Wallet
id: Didukung dompet digital

source: Cart
id: Keranjang

source: Total Purchase
id: Total Pembelian

# items_choosen
source: {item} Items Choosen
id: {item} Item dipilih

# pay_qris
source: Pay with QRIS
id: Bayar dengan QRIS

# qr_code
source: QR Code Payment
id: QR kode pembayaran

# note_qr
source: If you experience problems with payment, please contact our Contact Person at 083849788322
id: Jika kamu memiliki permasalahan pada pembayaran, silakan hubungi kontak tersebut 083849788322

# waiting_coming
source: Waiting for Item Coming
id: Tunggu item kamu tiba

source: Payment Success
id: Pembayaran sukses
